hotdb_scripts/10B_LuMDB_YCSB_performance/LuMDB_10B_val_128_memMiB_zipf1.2_iteratoration7.log
../../hotdb/release/db_bench --db=/mnt/hotdb_test/hotdb10B/ycsba_hot__P__1.2_iterator7 --num=1000000000 --value_size=128 --batch_size=1000 --benchmarks=fillzipf,stats --data_file=/home/jeff-wang/workloads/zipf1.2_keys10.0B.csv --logpath=/mnt/logs --bloom_bits=10 --log=1 --Read_data_file= --cache_size=8388608 --open_files=40000 --use_existing_db=false --reads=1000 --compression=0 --stats_interval=100000000 --histogram=1 --print_wa=true 
Keys:       16 bytes each
Values:     128 bytes each (64 bytes after compression)
Entries:    1000000000
RawSize:    137329.1 MB (estimated)
FileSize:   76293.9 MB (estimated)
WARNING: Optimization is disabled: benchmarks unnecessarily slow
WARNING: Assertions are enabled; benchmarks unnecessarily slow
WARNING: Snappy compression is not enabled
some command parameters have been selected:
  threads: 1
  duration: 0
  print_wa: 1
  num_entries: 1000000000
  bechmark selected fillzipf,stats
  hot_file_path: 
  data_file_path: /home/jeff-wang/workloads/zipf1.2_keys10.0B.csv
  percentages: 
  write_buffer_size: 1048576
  Hot data definition: 2
  Print Interval: 100000000
------------------------------------------------
we have 1 runs in level 0
we have 4 runs in level 1
we have 4 runs in level 2
we have 4 runs in level 3
we have 4 runs in level 4
we have 4 runs in level 5
we have 4 runs in level 6
After restoring, we have 0 leveling files and 0 Tiering file!
We have created a new mainfest file!
There 0 ranges was released in hot ranges!
we have 1 runs in level 0
we have 4 runs in level 1
we have 4 runs in level 2
we have 4 runs in level 3
we have 4 runs in level 4
we have 4 runs in level 5
we have 4 runs in level 6
After restoring, we have 0 leveling files and 0 Tiering file!
We have created a new mainfest file!
delete partition 3
delete partition 41
2024-11-20 22:23:09 ... thread 0: (100000000,100000000) ops and (56479.2,56479.2) ops/second in (1770.564500,1770.564500) seconds
                               Compactions
Level Files(Tier) Size(M) Time(s) Read(L) Read(T) Write(L) Write(T) m_comp si_comp(Tiering) ifile(Tiering) pfile(Tiering) se_comp(Tiering) ifiles(Tiering) pfiles(Tiering) comps triv_move t_last_b t_next_b
--------------------------------------------------
    0    12(  44)       0     535       0       0     2000    11782      0      84(    202)  2482(   9696)     0(      0)       0(      0)      0(      0)      0(      0)   286         0        0        0
    1    75(   8)       0     511    1996   12521     1542      803      0     740(      0)  2960(      0)     0(    396)       0(      0)      0(      0)      0(      0)   740         0        0        0
    2   430(   0)       0     342   10376       0     9717        0      0       0(      0)     0(      0)  4694(      0)       0(      0)      0(      0)      0(      0)     0         0        0        0
user_io:13781.961MB total_ios: 25844.239MB WriteAmplification: 1.8752
100000000 operations have been finished (user has been written 0.000 MB data into db.)


2024-11-20 23:02:42 ... thread 0: (100000000,200000000) ops and (42128.5,48259.6) ops/second in (2373.691311,4144.255811) seconds
                               Compactions
Level Files(Tier) Size(M) Time(s) Read(L) Read(T) Write(L) Write(T) m_comp si_comp(Tiering) ifile(Tiering) pfile(Tiering) se_comp(Tiering) ifiles(Tiering) pfiles(Tiering) comps triv_move t_last_b t_next_b
--------------------------------------------------
    0    20(  11)       0    1134       0       0     3689    23877      0     167(    411)  4474(  19728)     0(      0)       0(      0)      0(      0)      0(      0)   578         0        0        0
    1    38(   8)       0    1022    3681   25499     3084     1647      0    1517(      0)  6068(      0)     0(    814)       0(      0)      0(      0)      0(      0)  1517         0        0        0
    2   771(   0)       0    1109   36708       0    35175        0      0       0(      0)     0(      0) 17217(      0)       0(      0)      0(      0)      0(      0)     0         0        0        0
user_io:27566.280MB total_ios: 67473.006MB WriteAmplification: 2.4477
200000000 operations have been finished (user has been written 13733.014 MB data into db.)


2024-11-20 23:51:08 ... thread 0: (100000000,300000000) ops and (34414.3,42553.1) ops/second in (2905.766356,7050.022167) seconds
                               Compactions
Level Files(Tier) Size(M) Time(s) Read(L) Read(T) Write(L) Write(T) m_comp si_comp(Tiering) ifile(Tiering) pfile(Tiering) se_comp(Tiering) ifiles(Tiering) pfiles(Tiering) comps triv_move t_last_b t_next_b
--------------------------------------------------
    0    31(  26)       0    1657       0       0     5378    35972      0     250(    619)  6466(  29712)     0(      0)       0(      0)      0(      0)      0(      0)   869         0        0        0
    1     1(   8)       0    1492    5365   38416     4626     2487      0    2294(      0)  9176(      0)     0(   1230)       0(      0)      0(      0)      0(      0)  2294         0        0        0
    2   973(   0)       0    2569   75943       0    73479        0      0      91(      0)    91(      0) 36073(      0)       0(      0)      0(      0)      0(      0)    91        13        0        2
    3   104(   0)       0      24     958       0      958        0      0       0(      0)     0(      0)   383(      0)       0(      0)      0(      0)      0(      0)     0         0        2        0
user_io:41349.938MB total_ios: 122899.649MB WriteAmplification: 2.9722
300000000 operations have been finished (user has been written 27466.030 MB data into db.)


2024-11-21 00:50:42 ... thread 0: (100000000,400000000) ops and (27981.5,37651.3) ops/second in (3573.786568,10623.808735) seconds
                               Compactions
Level Files(Tier) Size(M) Time(s) Read(L) Read(T) Write(L) Write(T) m_comp si_comp(Tiering) ifile(Tiering) pfile(Tiering) se_comp(Tiering) ifiles(Tiering) pfiles(Tiering) comps triv_move t_last_b t_next_b
--------------------------------------------------
    0    42(  41)       0    2323       0       0     7067    48069      0     333(    827)  8458(  39696)     0(      0)       0(      0)      0(      0)      0(      0)  1160         0        0        0
    1   108(   8)       0    1997    7048   51334     6168     3326      0    3035(      0) 12140(      0)     0(   1646)       0(      0)      0(      0)      0(      0)  3035         0        0        0
    2  1003(   0)       0    4000  117039       0   113664        0      0     343(      0)   343(      0) 55867(      0)       0(      0)      0(      0)      0(      0)   343        16        0        2
    3   359(   0)       0     390    9500       0     9490        0      0       0(      0)     0(      0)  4347(      0)       0(      0)      0(      0)      0(      0)     0         0        2        0
user_io:55135.973MB total_ios: 187784.268MB WriteAmplification: 3.4058
400000000 operations have been finished (user has been written 41199.045 MB data into db.)


2024-11-21 02:15:50 ... thread 0: (100000000,500000000) ops and (19578.4,31783.4) ops/second in (5107.681444,15731.490179) seconds
                               Compactions
Level Files(Tier) Size(M) Time(s) Read(L) Read(T) Write(L) Write(T) m_comp si_comp(Tiering) ifile(Tiering) pfile(Tiering) se_comp(Tiering) ifiles(Tiering) pfiles(Tiering) comps triv_move t_last_b t_next_b
--------------------------------------------------
    0    31(   8)       0    3179       0       0     8756    60163      0     417(   1036) 10474(  49728)     0(      0)       0(      0)      0(      0)      0(      0)  1453         0        0        0
    1   108(   8)       0    2584    8752   64312     7728     4170      0    3812(      0) 15248(      0)     0(   2064)       0(      0)      0(      0)      0(      0)  3812         0        0        0
    2  1016(   0)       0    6105  160944       0   156606        0      0     620(      0)   620(      0) 77026(      0)       0(      0)      0(      0)      0(      0)   620        16        0        2
    3   624(   0)       0    1198   28155       0    28120        0      0       0(      0)     0(      0) 13296(      0)       0(      0)      0(      0)      0(      0)     0         0        2        0
user_io:68918.782MB total_ios: 265542.251MB WriteAmplification: 3.8530
500000000 operations have been finished (user has been written 54932.060 MB data into db.)


2024-11-21 03:51:10 ... thread 0: (100000000,600000000) ops and (17482.5,27970.1) ops/second in (5720.015314,21451.505493) seconds
                               Compactions
Level Files(Tier) Size(M) Time(s) Read(L) Read(T) Write(L) Write(T) m_comp si_comp(Tiering) ifile(Tiering) pfile(Tiering) se_comp(Tiering) ifiles(Tiering) pfiles(Tiering) comps triv_move t_last_b t_next_b
--------------------------------------------------
    0    41(  23)       0    4003       0       0    10444    72260      0     500(   1244) 12466(  59712)     0(      0)       0(      0)      0(      0)      0(      0)  1744         0        0        0
    1    75(   8)       0    3152   10435   77230     9269     5009      0    4588(      0) 18352(      0)     0(   2480)       0(      0)      0(      0)      0(      0)  4588         0        0        0
    2  1024(   0)       0    8401  205287       0   199982        0      0     904(      0)   904(      0) 98391(      0)       0(      0)      0(      0)      0(      0)   904        16        0        2
    3   890(   0)       0    2461   54142       0    54066        0      0       0(      0)     0(      0) 25864(      0)       0(      0)      0(      0)      0(      0)     0         0        2        0
user_io:82704.448MB total_ios: 351030.369MB WriteAmplification: 4.2444
600000000 operations have been finished (user has been written 68665.075 MB data into db.)


2024-11-21 05:24:38 ... thread 0: (100000000,700000000) ops and (17829.8,25868.3) ops/second in (5608.596687,27060.102180) seconds
                               Compactions
Level Files(Tier) Size(M) Time(s) Read(L) Read(T) Write(L) Write(T) m_comp si_comp(Tiering) ifile(Tiering) pfile(Tiering) se_comp(Tiering) ifiles(Tiering) pfiles(Tiering) comps triv_move t_last_b t_next_b
--------------------------------------------------
    0    53(  38)       0    4827       0       0    12133    84355      0     583(   1452) 14458(  69696)     0(      0)       0(      0)      0(      0)      0(      0)  2035         0        0        0
    1    38(   8)       0    3697   12117   90147    10810     5849      0    5365(      0) 21460(      0)     0(   2896)       0(      0)      0(      0)      0(      0)  5365         0        0        0
    2  1032(   0)       0   10618  250050       0   243776        0      0    1185(      0)  1185(      0) 119970(      0)       0(      0)      0(      0)      0(      0)  1185        17        0        2
    3  1149(   0)       0    3658   81554       0    81428        0      0       0(      0)     0(      0) 39154(      0)       0(      0)      0(      0)      0(      0)     0         0        2        0
user_io:96487.920MB total_ios: 438351.246MB WriteAmplification: 4.5431
700000000 operations have been finished (user has been written 82398.090 MB data into db.)


delete partition 42
delete partition 43
2024-11-21 07:10:19 ... thread 0: (100000000,800000000) ops and (15770.2,23951.2) ops/second in (6341.082265,33401.184445) seconds
                               Compactions
Level Files(Tier) Size(M) Time(s) Read(L) Read(T) Write(L) Write(T) m_comp si_comp(Tiering) ifile(Tiering) pfile(Tiering) se_comp(Tiering) ifiles(Tiering) pfiles(Tiering) comps triv_move t_last_b t_next_b
--------------------------------------------------
    0    23(   5)       0    5679       0       0    13822    96451      0     667(   1661) 16487(  79728)     0(      0)       0(      0)      0(      0)      0(      0)  2328         0        0        0
    1     1(   8)       0    4287   13802  103126    12353     6693      0    6142(      0) 24568(      0)     0(   3314)       0(      0)      0(      0)      0(      0)  6142         1        0        0
    2  1039(   0)       0   12909  295103       0   287858        0      0    1467(      0)  1467(      0) 141678(      0)       0(      0)      0(      0)      0(      0)  1467        17        0        2
    3  1403(   0)       0    5428  115501       0   115318        0      0       0(      0)     0(      0) 55660(      0)       0(      0)      0(      0)      0(      0)     0         0        2        0
user_io:110273.280MB total_ios: 532494.194MB WriteAmplification: 4.8289
800000000 operations have been finished (user has been written 96131.105 MB data into db.)


2024-11-21 09:13:38 ... thread 0: (100000000,900000000) ops and (13516.5,22059.1) ops/second in (7398.389122,40799.573567) seconds
                               Compactions
Level Files(Tier) Size(M) Time(s) Read(L) Read(T) Write(L) Write(T) m_comp si_comp(Tiering) ifile(Tiering) pfile(Tiering) se_comp(Tiering) ifiles(Tiering) pfiles(Tiering) comps triv_move t_last_b t_next_b
--------------------------------------------------
    0     4(  20)       0    6599       0       0    15511   108545      0     751(   1869) 18503(  89712)     0(      0)       0(      0)      0(      0)      0(      0)  2620         0        0        0
    1     1(   8)       0    4889   15507  116042    13914     7532      0    6919(      0) 27676(      0)     0(   3730)       0(      0)      0(      0)      0(      0)  6919         1        0        0
    2  1043(   0)       0   15615  340403       0   332188        0      0    1752(      0)  1752(      0) 163504(      0)       0(      0)      0(      0)      0(      0)  1752        18        0        2
    3  1659(   0)       0    7675  157872       0   157626        0      0       0(      0)     0(      0) 76313(      0)       0(      0)      0(      0)      0(      0)     0         0        2        0
user_io:124056.219MB total_ios: 635316.293MB WriteAmplification: 5.1212
900000000 operations have been finished (user has been written 109864.120 MB data into db.)


2024-11-21 10:51:33 ... thread 0: (100000000,1000000000) ops and (17019.1,21424.6) ops/second in (5875.740593,46675.314160) seconds
                               Compactions
Level Files(Tier) Size(M) Time(s) Read(L) Read(T) Write(L) Write(T) m_comp si_comp(Tiering) ifile(Tiering) pfile(Tiering) se_comp(Tiering) ifiles(Tiering) pfiles(Tiering) comps triv_move t_last_b t_next_b
--------------------------------------------------
    0     9(  35)       0    7294       0       0    17199   120642      0     834(   2077) 20495(  99696)     0(      0)       0(      0)      0(      0)      0(      0)  2911         0        0        0
    1   108(   8)       0    5431   17192  128959    15456     8372      0    7660(      0) 30640(      0)     0(   4146)       0(      0)      0(      0)      0(      0)  7660         1        0        0
    2  1043(   0)       0   17536  383714       0   374574        0      0    2028(      0)  2028(      0) 184386(      0)       0(      0)      0(      0)      0(      0)  2028        18        0        2
    3  1899(   0)       0    9627  205604       0   205291        0      0       0(      0)     0(      0) 99554(      0)       0(      0)      0(      0)      0(      0)     0         0        2        0
user_io:137841.595MB total_ios: 741535.445MB WriteAmplification: 5.3796
1000000000 operations have been finished (user has been written 123597.135 MB data into db.)


1000000000 operations have been finished (137330.149 MB data have been written into db)
fillzipf     :      46.675 micros/op 21424 ops/sec;    2.9 MB/s
Microseconds per op:
Count: 1000000000  Average: 46.6753  StdDev: 53010.15
Percentiles: P50: 1.12 P75: 1.58 P99: 2.57 P99.9: 4.94 P99.99: 20051.72
------------------------------------------------------
[       0,       1 ) 437676290  43.768%  43.768% #########
[       1,       2 ) 541526288  54.153%  97.920% ###########
[       2,       3 ) 18955867   1.896%  99.816% 
[       3,       4 )  428683   0.043%  99.859% 
[       4,       5 )  441013   0.044%  99.903% 
[       5,       6 )  345890   0.035%  99.937% 
[       6,       7 )  188310   0.019%  99.956% 
[       7,       8 )   98388   0.010%  99.966% 
[       8,       9 )   41508   0.004%  99.970% 
[       9,      10 )   19868   0.002%  99.972% 
[      10,      12 )   38412   0.004%  99.976% 
[      12,      14 )   21794   0.002%  99.978% 
[      14,      16 )   11321   0.001%  99.979% 
[      16,      18 )   32304   0.003%  99.983% 
[      18,      20 )   15164   0.002%  99.984% 
[      20,      25 )    4990   0.000%  99.985% 
[      25,      30 )    1454   0.000%  99.985% 
[      30,      35 )     512   0.000%  99.985% 
[      35,      40 )     404   0.000%  99.985% 
[      40,      45 )     467   0.000%  99.985% 
[      45,      50 )     422   0.000%  99.985% 
[      50,      60 )     630   0.000%  99.985% 
[      60,      70 )     584   0.000%  99.985% 
[      70,      80 )     651   0.000%  99.985% 
[      80,      90 )     661   0.000%  99.985% 
[      90,     100 )     615   0.000%  99.985% 
[     100,     120 )    1248   0.000%  99.985% 
[     120,     140 )    1208   0.000%  99.985% 
[     140,     160 )    1221   0.000%  99.986% 
[     160,     180 )    1527   0.000%  99.986% 
[     180,     200 )    1609   0.000%  99.986% 
[     200,     250 )    3787   0.000%  99.986% 
[     250,     300 )    3549   0.000%  99.987% 
[     300,     350 )    3207   0.000%  99.987% 
[     350,     400 )    2544   0.000%  99.987% 
[     400,     450 )    1864   0.000%  99.987% 
[     450,     500 )    1100   0.000%  99.988% 
[     500,     600 )    2080   0.000%  99.988% 
[     600,     700 )    1181   0.000%  99.988% 
[     700,     800 )     930   0.000%  99.988% 
[     800,     900 )     732   0.000%  99.988% 
[     900,    1000 )     598   0.000%  99.988% 
[    1000,    1200 )     829   0.000%  99.988% 
[    1200,    1400 )    1187   0.000%  99.988% 
[    1400,    1600 )    1191   0.000%  99.988% 
[    1600,    1800 )    1106   0.000%  99.989% 
[    1800,    2000 )    1020   0.000%  99.989% 
[    2000,    2500 )    2105   0.000%  99.989% 
[    2500,    3000 )    1656   0.000%  99.989% 
[    3000,    3500 )    1235   0.000%  99.989% 
[    3500,    4000 )    1031   0.000%  99.989% 
[    4000,    4500 )     971   0.000%  99.989% 
[    4500,    5000 )     836   0.000%  99.989% 
[    5000,    6000 )    1465   0.000%  99.990% 
[    6000,    7000 )    1409   0.000%  99.990% 
[    7000,    8000 )    1115   0.000%  99.990% 
[    8000,    9000 )     811   0.000%  99.990% 
[    9000,   10000 )     452   0.000%  99.990% 
[   10000,   12000 )     411   0.000%  99.990% 
[   12000,   14000 )     151   0.000%  99.990% 
[   14000,   16000 )      62   0.000%  99.990% 
[   16000,   18000 )      28   0.000%  99.990% 
[   18000,   20000 )      17   0.000%  99.990% 
[   20000,   25000 )    3577   0.000%  99.990% 
[   25000,   30000 )   14615   0.001%  99.992% 
[   30000,   35000 )    5945   0.001%  99.992% 
[   35000,   40000 )    6628   0.001%  99.993% 
[   40000,   45000 )    5947   0.001%  99.994% 
[   45000,   50000 )    5988   0.001%  99.994% 
[   50000,   60000 )    9320   0.001%  99.995% 
[   60000,   70000 )    6298   0.001%  99.996% 
[   70000,   80000 )    4840   0.000%  99.996% 
[   80000,   90000 )    3830   0.000%  99.997% 
[   90000,  100000 )    3163   0.000%  99.997% 
[  100000,  120000 )    4962   0.000%  99.998% 
[  120000,  140000 )    2783   0.000%  99.998% 
[  140000,  160000 )    1423   0.000%  99.998% 
[  160000,  180000 )    1311   0.000%  99.998% 
[  180000,  200000 )    1139   0.000%  99.998% 
[  200000,  250000 )    1808   0.000%  99.998% 
[  250000,  300000 )    1789   0.000%  99.999% 
[  300000,  350000 )    1957   0.000%  99.999% 
[  350000,  400000 )    1983   0.000%  99.999% 
[  400000,  450000 )    1691   0.000%  99.999% 
[  450000,  500000 )    1340   0.000%  99.999% 
[  500000,  600000 )    1458   0.000%  99.999% 
[  600000,  700000 )     786   0.000%  99.999% 
[  700000,  800000 )     602   0.000% 100.000% 
[  800000,  900000 )     531   0.000% 100.000% 
[  900000, 1000000 )     434   0.000% 100.000% 
[ 1000000, 1200000 )     509   0.000% 100.000% 
[ 1200000, 1400000 )     277   0.000% 100.000% 
[ 1400000, 1600000 )     175   0.000% 100.000% 
[ 1600000, 1800000 )    1036   0.000% 100.000% 
[ 1800000, 2000000 )     494   0.000% 100.000% 
[ 2000000, 2500000 )     479   0.000% 100.000% 
[ 2500000, 3000000 )     215   0.000% 100.000% 
[ 3000000, 3500000 )     113   0.000% 100.000% 
[ 3500000, 4000000 )      57   0.000% 100.000% 
[ 4000000, 4500000 )      43   0.000% 100.000% 
[ 4500000, 5000000 )      23   0.000% 100.000% 
[ 5000000, 6000000 )      29   0.000% 100.000% 
[ 6000000, 7000000 )      22   0.000% 100.000% 
[ 7000000, 8000000 )      18   0.000% 100.000% 
[ 8000000, 9000000 )      18   0.000% 100.000% 
[ 9000000, 10000000 )      20   0.000% 100.000% 
[ 10000000, 12000000 )      20   0.000% 100.000% 
[ 12000000, 14000000 )       3   0.000% 100.000% 
[ 14000000, 16000000 )       6   0.000% 100.000% 
[ 16000000, 18000000 )       3   0.000% 100.000% 
[ 18000000, 20000000 )       6   0.000% 100.000% 
[ 20000000, 25000000 )      10   0.000% 100.000% 
[ 25000000, 30000000 )      16   0.000% 100.000% 
[ 30000000, 35000000 )       8   0.000% 100.000% 
[ 35000000, 40000000 )      12   0.000% 100.000% 
[ 40000000, 45000000 )      13   0.000% 100.000% 
[ 45000000, 50000000 )      15   0.000% 100.000% 
[ 50000000, 60000000 )      31   0.000% 100.000% 
[ 60000000, 70000000 )      30   0.000% 100.000% 
[ 70000000, 80000000 )      25   0.000% 100.000% 
[ 80000000, 90000000 )      23   0.000% 100.000% 
[ 90000000, 100000000 )      22   0.000% 100.000% 
[ 100000000, 120000000 )      53   0.000% 100.000% 
[ 120000000, 140000000 )      42   0.000% 100.000% 
[ 140000000, 160000000 )      18   0.000% 100.000% 
[ 160000000, 180000000 )       2   0.000% 100.000% 
[ 180000000, 200000000 )       2   0.000% 100.000% 
[ 250000000, 300000000 )       1   0.000% 100.000% 


                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0       44        0      7294        0    137842
  1      116        0      5431   146151     23828
  2     1043        0     17536   383714    374574
  3     1899        0      9627   205604    205291
user_io:137841.595MB total_ios: 741535.445MB WriteAmplification: 5.3796

There 0 ranges was released in hot ranges!